<div id="introduction">
    <p class="yekan introduction_title">
        معرفی اجمالی محصول
    </p>
    <a class="yekan" id="more">
        نمایش بیشتر
    </a>
    <p class="yekan introduction_text">
        عرضه‌ی یک گوشی که بتواند به‌عنوان یک دوربین تمام‌عیار استفاده شود، در بین تولیدکنندگان باب شده است. در طول
        چند سال اخیر، لنوو که با کم کردن حاشیه‌ی سودش، شهرتی برای خود در بازار موبایل دست‌وپا کرده؛ سعی دارد تا با
        تولید گوشی‌های خاص این راه را ادامه دهد. گوشی «لنوو وایب شات» (Lenovo VIBE Shot) با محوریت و تمرکز روی
        دوربین، گوشی کم‌نظیری را تولید کرده است. سخت‌افزاری مناسب، نمایشگری با کیفیت و بزرگ در کنار طراحی زیبا و
        چشم‌نواز از دیگر قابلیت‌های گوشی جدید لنوو هستند. دوربینی با سنسور 16 مگایپکسلی به همراه فلشی از نوع LED
        سه‌گانه می‌توانند مهر تاییدی به سعی لنوو برای عرضه‌ی یک گوشی با تاکید بر روی عکاسی باشند. این دوربین به لرزش
        گیر اپتیکال تصویر و ویدیو هم مجهز شده است تا تصاویر آن با بهترین کیفیت ممکن ثبت شوند و لرزش دست در آن‌ها
        تاثیری نداشته باشند. دوربین سلفی هم سنسوری 8 مگاپیکسلی دارد. هر دو دوربین می‌توانند ویدیوهایی با رزولوشن
        fullHD و سرعت 30 فریم بر ثانیه ثبت کنند. تصاویر دوربین اصلی از کیفیت و شفافیت کم‌نظیری برخوردار هستند و این
        موضوع نشان می‌دهد که لنوو به وظیفه‌اش به‌درستی عمل کرده است. لنوو نه‌تنها به دوربین اهمیت داده، بلکه
        سخت‌افزار مناسبی هم برای وایب شات در نظر گرفته است. تراشه‌ی کوالکام مدل اسنپ‌دارگون 615 کمی فراتر از یک
        تراشه‌ی میان‌رده عمل می‌کند و در کنار سه گیگابایت رم می‌تواند، پاسخ خوبی برای تمام نیازهای کوچک و بزرگ کاربر
        باشد. همچنین وایب شات 32 گیگابایت حافظه‌ی داخلی دارد که می‌توان آن را تا 128 گیگابایت افزایش داد. این گوشی
        دو سیم‌کارته می‌تواند از شبکه‌ی 4G هم پشتیبانی کند. در کنار قابلیت پشتیبانی از شبکه‌ی 4G، فناوری‌هایی مثل
        Wi-Fi، بلوتوث و رادیو هم برای کاربران این گوشی فراهم شده است. همه‌ی قابلیت‌های یک گوشی زمانی کاربرپسند
        می‌شوند و جلوه پیدا می‌کنند که این گوشی از ظاهری زیبا برخوردار باشد. لنوو، این گوشی را که تنها 7.3 میلی‌متر
        ضخامت دارد از شیشه و فلز ساخته است. جالب است با این دوربین عالی، این گوشی در هیچ قسمتی برآمدگی ندارد و قاب
        پشتی و جلویی آن کاملا صاف هستند. برای محافظت از قاب پشت و جلویی این گوشی از محافظ‌های گوریلا گلس کمک
        گرفته‌شده است. نمایشگر 5 اینچی این گوشی در قابی به ابعاد 142 در 70 میلی‌متر قرارگرفته که ابعادش مناسب به نظر
        می‌رسند. از دیگر قابلیت‌های این گوشی زیبا می‌توان به نمایشگر 5 اینچی با رزولوشن 1920 در 1080 و تراکم 441
        پیکسل بر اینچ‌اش اشاره کرد که برای وبگردی، بازی و مطالعه کاملا مطلوب به نظر می‌رسد. همچنین اندروید لالی‌پاپ
        نسخه‌ی 5.0 همراه با پشتیبانی کامل از زبان فارسی و باتری 3000 میلی‌آمپر ساعتی لیتیوم-پلیمری از دیگر ویژگی‌های
        مناسب در این گوشی به‌حساب می‌آیند. لنوو وایب شات دوربینی کم‌نظیری را در کنار قابلیت‌هایی همچون سخت‌افزاری بر
        پایه‌ی تراشه‌ی اسنپ‌دراگون 615، مقدار سه گیگابایت رم، اندروید لالی‌پاپ نسخه‌ی 5.1، نمایشگری با تراکم 441
        پیکسل بر هر اینچ و طراحی زیبا و چشم‌نواز به کاربرانش عرضه می‌کند. این قابلیت‌ها در کنار قیمت مناسب این گوشی
        می‌توانند عواملی وسوسه کننده برای خرید این گوشی باشند.
    </p>
</div>
<script>
    // tozih mahsoul
    $('#introduction #more').click(function () {
        $('#introduction').toggleClass('active');
    });
</script>